# File       : cix-todo.org
# Created    : <2017-8-06 Sun 22:58:42 BST>
# Modified   : <2020-10-20 Tue 00:39:52 BST>
# Maintainer : #Rλatan
# Sinopsis   :

* Cleanups [3/4][75%]
** DONE Menu link fix
   CLOSED: [2017-08-07 Mon 00:32]
   :LOGBOOK:  
   - State "DONE"       from "TODO"       [2017-08-07 Mon 00:32]
   :END:      

| FROM                    | TO                    | WHEN             |
|-------------------------+-----------------------+------------------|
| =[../README.org::*Index]= | =[file:../cix-main.org= | [2017-08-06 Sun] |
|                         |                       |                  |
|-------------------------+-----------------------+------------------|

[[file:../cix-main.org][|≣|]]
#+NAME: menu-link-fix--fixer
#+BEGIN_SRC sh
  #!/usr/bin/env bash

  find ./spices -type f -print0 \
      | xargs -0 -n1 -I'{}' \
              sed -i \
              -e 's/.*≣.*/\[\[file:..\/cix-main\.org\]\[\|≣\|\]\]/g' \
              {}

  grep -L "≣" ./spices/*org \
      | xargs -n1 \
              sed -i 's/\(^.*TITLE.*\)/\[\[file:..\/cix-main\.org\]\[\|≣\|\]\]\1/g'
#+END_SRC
#+RESULTS:

#+NAME: menu-link-fix--check
#+BEGIN_SRC sh :results value org output replace :exports results
      #!/usr/bin/env bash

  printf "Total files: %s\n" "$(ls ./spices/*org | wc -l)"
  printf "Right menu: %s\n" \
         "$(find ./spices -type f -name "*org" -print0 \
               | xargs -0 grep  "\[\[file:..\/cix-main.org\]\[|≣|\]\]" \
               | wc -l)"
  echo "Rest to fix"
  find ./spices -type f -print0 \
       | xargs -0 grep -L "≣"
#+END_SRC
#+RESULTS: menu-link-fix--check
#+BEGIN_SRC org
Total files: 114
Right menu: 114
Rest to fix
#+END_SRC

** DONE Header
   CLOSED: [2017-08-07 Mon 00:42]
   :LOGBOOK:  
   - State "DONE"       from "TODO"       [2017-08-07 Mon 00:42]
   :END:      
=^#\s*Short.*:= --> # Sinopsis :
** DONE Add # Enf of <file>
   CLOSED: [2017-09-04 Mon 22:46]
#+BEGIN_SRC sh
  #!/usr/bin/env bash
  SEARCH_PATH="../spices"
  find "$SEARCH_PATH" -name "*org" -print0 \
      | xargs -0 -n1 -I{} sed '$!d' {} \
     # | grep -v "End of" \
     # | xargs -n1 -I{} grep {} "$SEARCH_PATH"/*org \
     # | grep -oP "(?<=^\./).+(?=\.org:)" \
     # | sort -u
#+END_SRC

#+RESULTS:
| /home/sharlatan/Projects/my-GitHub/cix/org |
| cix-ack.org                                |
| cix-acl.org                                |
| cix-ag.org                                 |
| cix-alsa.org                               |
| cix-aptitude.org                           |
| cix-apt.org                                |
| cix-ash.org                                |
| cix-at.org                                 |
| cix-autoconf.org                           |
| cix-autofs.org                             |
| cix-automake.org                           |
| cix-bind-utils.org                         |
| cix-bridge-utils.org                       |
| cix-btrfs-progs.org                        |
| cix-busybox.org                            |
| cix-bzip2.org                              |
| cix-cpio.org                               |
| cix-cronie.org                             |
| cix-ctags.org                              |
| cix-curlftpfs.org                          |
| cix-curl.org                               |
| cix-dash.org                               |
| cix-diffutils.org                          |
| cix-dmidecode.org                          |
| cix-dnf.org                                |
| cix-dpkg.org                               |
| cix-e2fsprogs.org                          |
| cix-emacs.org                              |
| cix-fdupes.org                             |
| cix-ffmpeg.org                             |
| cix-file.org                               |
| cix-fish-shell.org                         |
| cix-fontconfig.org                         |
| cix-gawk.org                               |
| cix-gcc.org                                |
| cix-gdb.org                                |
| cix-git.org                                |
| cix-glibc.org                              |
| cix-global.org                             |
| cix-gnu-bash.org                           |
| cix-gnu-binutils.org                       |
| cix-gnu-bishttp://heirloom.cvs.sourceforge.net/viewvc/heirloom/heirloom/on.org                          |
| cix-gnu-coreutils.org                      |
| cix-gnu-findutils.org                      |
| cix-gnu-grep.org                           |
| cix-gnu-inetutils.org                      |
| cix-gnupg.org                              |
| cix-gzip.html                              |
| cix-gzip.org                               |
| cix-hall-of-fame.org                       |
| cix-imagemagick.org                        |
| cix-iproute2.org                           |
| cix-iptables.org                           |
| cix-iputils.org                            |
| cix-jq.org                                 |
| cix-kbd.org                                |
| cix-kmod.org                               |
| cix-less.org                               |
| cix-lrzip.org                              |
| cix-lshw.org                               |
| cix-lsof.org                               |
| cix-lsyncd.org                             |
| cix-lvm2.org                               |
| cix-make.org                               |
| cix-man-db.org                             |
| cix-micro.org                              |
| cix-moreutils.org                          |
| cix-nano.org                               |
| cix-ncurses.org                            |
| cix-netcat.org                             |
| cix-netkit.org                             |
| cix-net-snmp.org                           |
| cix-net-tools.org                          |
| cix-nfs.org                                |
| cix-nmap.org                               |
| cix-openssh.org                            |
| cix-pacman.org                             |
| cix-pam.org                                |
| cix-parallel.org                           |
| cix-parted.html                            |
| cix-parted.org                             |
| cix-pax.org                                |
| cix-pciutils.org                           |
| cix-perf.org                               |
| cix-pkg-pkgng.org                          |
| cix-pm-utils.org                           |
| cix-procps-ng.org                          |
| cix-psmisc.org                             |
| cix-pulseaudio.org                         |
| cix-quota.org                              |
| cix-ripgrep.org                            |
| cix-rpm.org                                |
| cix-rsync.org                              |
| cix-screen.org                             |
| cix-sed.org                                |
| cix-selinux.org                            |
| cix-shadow-utils.org                       |
| cix-sift.org                               |
| cix-smartmontools.org                      |
| cix-smem.org                               |
| cix-sox.org                                |
| cix-strace.org                             |
| cix-stress-ng.org                          |
| cix-stress.org                             |
| cix-sudo.org                               |
| cix-systemd.org                            |
| cix-tar.org                                |
| cix-tcpdump.org                            |
| cix-tcsh.org                               |
| cix-tmux.org                               |
| cix-toybox.org                             |
| cix-ucg.org                                |
| cix-unix-land.org                          |
| cix-unizp.org                              |
| cix-upstart.org                            |
| cix-usbutils.org                           |
| cix-util-linux.org                         |
| cix-valgrind.org                           |
| cix-vim.org                                |
| cix-vsftp.org                              |
| cix-wget.org                               |
| cix-xz.org                                 |
| cix-zsh.org                                |

** TODO Spell check all files
* Roadmap [1/7][14%]
** DONE Add/check header table 
   CLOSED: [2017-09-03 Sun 23:54]
*** Files with no *Author*
  #+BEGIN_SRC sh
  find ./spices -type f -print0 | xargs -0 grep -Po "\*Author\*\s*\|\s*\|"
  #+END_SRC

  #+RESULTS:

No header table at all:
#+BEGIN_SRC sh
  grep -rL "\*Author" ./spices
#+END_SRC

#+RESULTS:

*** Files without *Released*
  #+BEGIN_SRC sh
  find ./spices -type f -print0 | xargs -0 grep -Po "\*Released\*\s*\|\s*\|"
  #+END_SRC

  #+RESULTS:

#+BEGIN_SRC sh
find ./spices -type f -print0 | xargs -0 grep -H -c "\*Released\*" | grep 0$ | cut -d":" -f1
#+END_SRC

#+RESULTS:
| ./spices/cix-nfs.org          |
| ./spices/cix-wget.org         |
| ./spices/cix-bind-utils.org   |
| ./spices/cix-parted.html      |
| ./spices/cix-unix_land.org    |
| ./spices/cix-hall-of-fame.org |

*** Files without *Source*
#+BEGIN_SRC sh
find ./spices -type f -print0 | xargs -0 grep -Po "\*Source\*\s*\|\s*\|"
#+END_SRC

#+RESULTS:
*** Files without # Sinopsis 
#+BEGIN_SRC sh
  #!/usr/bin/env bash

  find ./spices -type f -print0 \
      | xargs -0 grep -Po "^\# Sinopsis\s*\:$" \
#+END_SRC

#+RESULTS:
: ./spices/cix-gnu-inetutils.org:# Sinopsis :

#+BEGIN_SRC sh 
find ./ -printf "%T@ %y %s %p\n" | grep -v "\.git\|\#\|\./$" | sort -rn | column -t  > MANIFEST 
#+END_SRC
** TODO Add supported OSes to cix-main.org
*** With OS lables
#+BEGIN_SRC sh :results raw
grep -P "^ *\+" ../cix-main.org | grep "\="
#+END_SRC

#+RESULTS:
  + [[./spices/cix-busybox.org][BusyBox]] :: the swiss army knife of embedded Linux: =GNU/Linux= =FreeBSD=
  + [[./spices/cix-gnu-coreutils.org][gnu-coreutis]] :: basic file, shell and text manipulation utilities: =GNU/Linux= =FreeBSD HP-UX AUX=
  + [[./spices/cix-kbd.org][kbd]] :: tools for configuring the console: =GNU/Linux=
  + [[./spices/cix-man-db.org][man-db]] :: tools for searching and reading man pages: =GNU/Linux=
  + [[file:spices/cix-ncurses.org][ncurses]] :: terminal-independent method of updating character screens: =GNU/Linux FreeBSD UNIX OS-X NetBSD=
  + [[file:./spices/cix-the-heirloom-project.org][the heirloom project]] :: traditional implementations of standard UNIX utils: =SanOS=
  + [[./spices/cix-util-linux.org][util-linux]] :: is a standard package of the Linux operating system: =GNU/Linux=
  + [[./spices/cix-file.org][file]] :: a utility for determining file types: =GNU/Linux NetBSD FreeBSD OS/2 DOS Win=
  + [[./spices/cix-less.org][less]] :: a text file browser similar to more, but better: =GNU/Linux UNIX OS-X=
  + [[./spices/cix-vim.org][vim]] :: recent enhancements of vim: =FreeBSD= =GNU/Linux= =OS-X=
  + [[file:./spices/cix-curl.org][curl]] :: a utility for getting files from remote servers: =GNU/Linux FreeBSD=
  + [[file:./spices/cix-glusterfs.org][glusterfs]] :: distributed file system: =GNU/Linux FreeBSD NetBSD OpenSolaris OS-X=
  + [[file:./spices/cix-gnu-parted.org][parted]] :: the GNU disk partition manipulation program: =GNU/Linux=
  + [[file:./spices/cix-iw.org][iw]] :: A nl80211 based wireless configuration tool: =GNU/Linux=
  + [[./spices/cix-dmidecode.org][dmidecode]] :: tool to analyse bios dmi data: =GNU/Linux= =FreeBSD= =NetBSD= =OpenBSD= =BeOS= =Solaris= =Haiku=
  + [[./spices/cix-lshw.org][lshw]] :: hardware lister: =GNU/Linux=
  + [[file:./spices/cix-oprofile.org][OProfile]] :: System wide profiler: =GNU/Linux=
  + [[./spices/cix-pciutils.org][pciutils]] :: pci bus related utilities: =FreeBSD= =NetBSD= =OpenBSD= =GNU/Linux= =FreeBSD= =Solaris/i386= =AIX= =GNU/Hurdd= =Windows= =Cygwin= =BeOS= =Haiku= =Darwin=
  + [[./spices/cix-perf.org][perf]] :: Performance monitoring for the Linux kerne: =GNU/Linux=
  + [[./spices/cix-smartmontools.org][smartmontools]] :: tools for monitoring smart capable hard disks: =OS-X= =GNU/Linux= =FreeBSD= =NetBSD= =OpenBSD= =Solaris= =OS/2= =Cygwin= =QNX= =eComStation= =Win=
  + [[./spices/cix-stress.org][stress]] :: A tool to put given subsystems under a specified load: =GNU/Linux= =Gentoo= =OpenBSD= =FreeBSD=
  + [[file:./spices/cix-stress-ng.org][stress-ng]] :: stress test a computer system in various ways: =GNU/Linux= =GNU/Hurd= =FreeBSD= =OpenBSD= =NetBSD= =FreeBSD= =MINIX= =OpenIndiana=
  + [[./spices/cix-usbutils.org][usbutils]] :: Linux usb utilities: =GNU/Linux=
  + [[file:./spices/cix-jq.org][jq]] :: command-line json processor: =OS-X= =FreeBSD= =Solaris= =GNU/Linux= =Win=
  + [[file:./spices/cix-sift.org][sift]] :: A fast and powerful alternative to grep: =OS-X= =GNU/Linux=
  + [[./spices/cix-xz.org][xz]] :: lzma compression utilities: =GNU/Linux= =FreeBSD=
  + [[./spices/cix-iptables.org][iptables]] :: Linux kernel packet filtering capabilities: =GNU/Linux=
  + [[./spices/cix-iputils.org][iputils]] :: network monitoring tools including ping: =GNU/Linux= 
  + [[./spices/cix-net-snmp.org][net-snmp]] :: a collection of snmp protocol tools and libraries: =GNU/Linux= =FreeBSD= =OpenBSD= =Solaris/SPARC= =OS-X= =AIX= =HP-UX= =NetBSD= =OSF= =SunOS= =Ultrix= =QNX= =Dynix= =IRIX= =Win=
  + [[./spices/cix-openssh.org][OpenSSH]] :: an open source implementation of ssh protocol: =AIX= =HP-UX= =IRIX= =GNU/Linux= =Next= =Sco= =Sni/Reliant= =Unix= =Solaris= =Digital= =Unix/Tru64/Osf= =Mac= =Os-X= =Cygwin=
  + [[./spices/cix-tcpdump.org][tcpdump]] :: dump traffic on a network: =GNU/Linux= =FreeBSD=
  + [[file:./spices/cix-netperf.org][netperf]] :: TCP/UDP/sockets/etc performance benchmark: =FreeBSD= =AIX= =Solaris= =GNU/Linux= =HP-UX= =IRIX=
  + [[file:./spices/cix-netcat.org][netcat]] :: a simple Unix utility which reads and writes data across network connections, using TCP or UDP protocol: =DOS= =ULTRIX= =SunOS= =Solaris= =AIX= =GNU/Linux= =IRIX= =OSF= =NetBSD= =HP-UX= =AUX= =NeXT=
  + [[./spices/cix-tcsh.org][tcsh]] :: An enhanced version of csh, the C shell: =FreeBSD=
  + [[file:./spices/cix-alsa.org][alsa]] :: advanced Linux sound architecture (alsa) utilities: =GNU/Linux=
  + [[file:./spices/cix-pam.org][pam]] :: an extensible library which provides authentication for applications: =AIX DragonFly-BSD FreeBSD HP-UX Linux OS-X NetBSD Solaris=
  + [[file:./spices/cix-selinux.org][SElinux]] :: Security-Enhanced Linux: =GNU/Linux=
  + [[file:./spices/cix-syslinux.org][syslinux]] :: Simple kernel loader which boots from a FAT filesystem: =GNU/Linux=
  + [[file:./spices/cix-gnu-grub2.org][grub2]] :: Bootloader with support multiboot and more: =GNU/Linux= 
  + [[file:./spices/cix-pkg-pkgng.org][pkg/pkgng]] :: is the Next Generation package management tool for FreeBSD: =FreeBSD=
  + [[file:./spices/cix-dtrace.org][dtrace]] :: comprehensive dynamic tracing framework: =Solaris= =FreeBSD= =NetBSD= =OS-X=
*** Without OS lables
#+BEGIN_SRC sh :results raw
grep -P "^ *\+" ../cix-main.org | grep -v "\="
#+END_SRC

#+RESULTS:
  + [[./spices/cix-hall-of-fame.org][hall of fame]] :: who made it posible!
  + [[./spices/cix-unix-land.org][unix land]] :: common unix commands.
  + bsd :: list of common bsd commands
  + [[./spices/cix-toybox.org][toybox]]  :: common Linux commands for embedded systems (POSIX-2008 and LSB 4.1).
  + [[file:./spices/cix-diffutils.org][diffutils]] :: a gnu collection of diff utilities
  + [[./spices/cix-emacs.org][emacs]] :: gnu emacs text editor
  + [[./spices/cix-gawk.org][gawk]] :: the gnu version of the awk text processing utility
  + [[./spices/cix-lsof.org][lsof]] :: a utility which lists open files on a Linux/unix system 
  + [[./spices/cix-micro.org][micro]] :: a modern and intuitive terminal-based text editor
  + [[./spices/cix-nano.org][nano]] :: a small text editor
  + [[./spices/cix-sed.org][sed]] :: a gnu stream text editor
  + [[./spices/cix-lsyncd.org][lsyncd]] :: live syncing daemon synchronizes local directories with remote targиets
  + [[file:./spices/cix-rsync.org][rsync]] :: a program for synchronizing files over a network
  + [[./spices/cix-vsftp.org][vsftp]] :: very secure ftp daemon
  + [[file:./spices/cix-wget.org][wget]] :: a utility for retrieving files using the http or ftp protocols
  + [[./spices/cix-acl.org][acl]] :: access control list utilities
  + [[./spices/cix-autofs.org][autofs]] :: a tool for automatically mounting and unmounting filesystems
  + [[file:./spices/cix-bindfs.org][bindfs]] :: fuse filesystem to mirror a directory
  + [[./spices/cix-btrfs-progs.org][btrfs-progs]] :: userspace programs for btrfs.
  + [[./spices/cix-curlftpfs.org][curlftpfs]] :: is a fs for accessing ftp hosts based on fuse and libcurl
  + [[./spices/cix-e2fsprogs.org][e2fsprogs]] :: filesystem utilities for use with ext2/3/4
  + [[./spices/cix-lvm2.org][lvm2]] :: userland logical volume management tools
  + [[./spices/cix-nfs.org][nfs]] :: utilities for rall out NFS share 
  + [[./spices/cix-quota.org][quota]] :: system tools for monitoring users disk usage
  + [[./spices/cix-gnu-binutils.org][gnu-binutils]] :: collection of binary tools
  + [[./spices/cix-moreutils.org][moreutils]] :: tools that nobody thought to write when unix was young
  + [[file:./spices/cix-parallel.org][parallel]] :: shell tool for executing jobs in parallel
  + [[./spices/cix-pm-utils.org][pm-utils]] :: suspend and powerstate setting framework
  + [[./spices/cix-procps-ng.org][procps-ng]] :: utilities for monitoring your system and its processes
  + [[./spices/cix-psmisc.org][psmisc]] :: is a set of small utilities that use the proc filesystem.
  + [[./spices/cix-shadow-utils.org][shadow-utils]] :: utilities for managing accounts and shadow password files
  + [[file:./spices/cix-smem.org][smem]] :: Report application memory usage in a meaningful way
  + [[file:./spices/cix-vmtouch.org][vmtouch]] :: Portable file system cache diagnostics and control
  + [likwid]  ::
  + [[./spices/cix-ack.org][ack]] :: grep-like text finder
  + [[./spices/cix-ag.org][ag]] :: super-fast text searching tool - The Silver Searcher
  + [[./spices/cix-fdupes.org][fdupes]] :: finds duplicate files in a given set of directories
  + [[./spices/cix-gnu-findutils.org][gnu-findutils]] :: the gnu versions of find utilities (find and xargs)
  + [[./spices/cix-gnu-grep.org][gnu-grep]] :: pattern matching utilities
  + [[file:./spices/cix-ripgrep.org][ripgrep]] :: rg combines the usability of The Silver Searcher with the raw speed of grep.
  + [[file:./spices/cix-ucg.org][ucg]] :: extremely fast grep-like tool specialized for searching large bodies of source code.
  + [[./spices/cix-bzip2.org][bzip2]] :: a file compression utility
  + [[./spices/cix-cpio.org][cpio]] :: a gnu archiving program
  + [[./spices/cix-tar.org][tar]] :: a file archiving program
  + [[./spices/cix-gzip.org][gzip]] :: the gnu data compression program
  + [[./spices/cix-unizp.org][unzip]] :: a utility for unpacking zip files
  + [[./spices/cix-lrzip.org][lrzip]] :: compression program optimized for large files
  + [[./spices/cix-pax.org][pax]] :: POSIX file system archiver
  + [[./spices/cix-bind-utils.org][bind-utils]] :: utilities for querying dns name server
  + [[file:./spices/cix-bridge-utils.org][bridge-utils]] :: utilities for configuring the Linux ethernet bridge
  + [[./spices/cix-gnu-inetutils.org][gnu-inetutils]] :: a collection of common network programs
  + [[./spices/cix-iproute2.org][iproute2]] :: routing commands and utilities
  + [[./spices/cix-net-tools.org][net-tools]] :: collection of base networking utilities
  + [[./spices/cix-nmap.org][nmap]] :: network exploration tool and security scanner
  + [[file:./spices/cix-nmap-ncat.org][nmap-ncat]] :: Nmap's Netcat replacement
  + [[./spices/cix-gnu-bash.org][gnu-bash]] :: gnu bash shell built in commands
  + [[./spices/cix-fish-shell.org][fish-shell]] ::  a friendly interactive shell
  + [[./spices/cix-screen.org][screen]] :: a screen manager that supports multiple logins on one terminal
  + [[./spices/cix-tmux.org][tmux]] :: a terminal multiplexer
  + [[./spices/cix-zsh.org][zsh]] ::  powerful interactive shell
  + [[file:./spices/cix-dash.org][dash]] :: Small and fast POSIX-compliant shell
  + [[file:./spices/cix-ash.org][ash]] :: Almquist SHell in NetBSD
  + [[./spices/cix-at.org][at]] :: job spooling tools
  + [[./spices/cix-cronie.org][cronie]]  :: cron daemon for executing programs at set times
  + [[./spices/cix-ffmpeg.org][ffmpeg]] :: digital vcr and streaming server
  + [[file:./spices/cix-fontconfig.org][fontconfig]] :: font configuration and customization library
  + [[file:./spices/cix-pulseaudio.org][pulseaudio]] :: pulseaudio sound server utilities
  + [[file:./spices/cix-sox.org][sox]] :: a general purpose sound file conversion tool
  + [[file:./spices/cix-imagemagick.org][ImageMagick]] :: An X application for displaying and manipulating images
  + [[file:./spices/cix-sudo.org][sudo]] :: allows restricted root access for specified users
  + [apparmor] :: 
  + [[./spices/cix-systemd.org][systemd]] ::  a system and service manager
  + [[./spices/cix-upstart.org][upstart]] :: event-based init daemo
  + [[./spices/cix-autoconf.org][autoconf]] :: a gnu tool for automatically configuring source code
  + [[file:./spices/cix-automake.org][automake]] :: A GNU tool for automatically creating Makefiles
  + [[file:./spices/cix-gnu-bison.org][bison]] ::  A GNU general-purpose parser generator
  + [[file:./spices/cix-ctags.org][ctags]] :: A C programming language indexing and/or cross-reference tool
  + [[./spices/cix-gcc.org][gcc]] :: various compilers (c, c++, objective-c, java, ...)
  + [[./spices/cix-gdb.org][gdb]] :: a gnu source-level debugger for C, C++, Fortran, Go and other languages
  + [[file:./spices/cix-git.org][git]] :: Fast Version Control System
  + [[./spices/cix-glibc.org][glibc]] :: common binaries and locale data for glibc
  + [[file:./spices/cix-global.org][global]] :: Source code tag system
  + [[file:./spices/cix-make.org][make]] :: A tool which simplifies the build process for users
  + [[file:./spices/cix-valgrind.org][valgrind]] :: Tool for finding memory management bugs in programs
  + [[file:./spices/cix-cmake.org][cmake]] :: Cross-platform make system
  + [[./spices/cix-apt.org][apt]] :: Debian/Ubuntu commandline package panager.
  + [[file:spices/cix-aptitude.org][aptitude]] :: is a featureful package manager for debian GNU/Linux systems
  + [[file:./spices/cix-dnf.org][dnf]] :: fork of yum, using libsolv as a dependency resolve
  + [[file:./spices/cix-dpkg.org][dpkg]] :: package manager for debian
  + [[file:spices/cix-pacman.org][pacman]] :: is one of the major distinguishing features of Arch Linux
  + [[file:./spices/cix-rpm.org][rpm]] :: package manager is a command line driven package management system
  + [[./spices/cix-netkit.org][Linux Netkit]] :: Utilities for managing processes on your system
  + [[./spices/cix-kmod.org][kmod]] :: Linux kernel module management utilities
  + [[./spices/cix-strace.org][strace]] :: tracks and displays system calls associated with a running process
  + ftrace ::
  + ktrace ::
  + ltrace ::
  + SystemTap ::
  + LTTng ::
  + ProbeVue :: 
  + [[./spices/cix-gnu-pg.org][gnupg]] :: A GNU utility for secure communication and data storage

** TODO Help extractor to cix-stat.sh

# End of cix-todo.org

|   | test |
|   | test |
|   | test |
|   | test |
|   | test |
|   | test |
|   | test |

#+BEGIN_SRC sh
ls

#+END_SRC

#+RESULTS:
| cix-convension.org |
| cix-main.org       |
| cix-stat.sh        |
| cix-todo.org       |
| img                |
| LICENSE            |
| README.org         |
| README-ru.md       |
| spices             |
| tests              |
| tutors             |
** TODO Add references
*** Links
*** CVE
*** papers
** TODO Add at least one example per cmd 
** TODO Add a short intro to each cix-* files
** TODO Configuration files 
*** what to include [2/5]
- [X] vsftpd
- [X] grub
- [ ] slim
- [ ] sshd/ssh
- [ ] 
